Revit 2024 API
ConnectionResolution Enumeration
 An enumerated type listing all the possible resolutions for connectivity validation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public enum ConnectionResolution
Visual Basic
Public Enumeration ConnectionResolution
Visual C++
public enum class ConnectionResolution
Members
Member name | Description
Disconnected |  Value for parts were disconnected.
See Also
Autodesk.Revit.DB Namespace